import React from "react";
import yarden from "./assets/yarden.jpg";
import "./css/About.css";

const About = () => {
  return (
    <div className="about-container">
      <h1 className="about-title">יוצר האתר</h1>
      <div className="about-content">
        <img src={yarden} alt="yarden" className="about-img" />
        <p className="about-text">
          שמי ירדן הללי, סטודנט להנדסת תוכנה בבית הספר הארצי להנדסאים בטכניון.
          הפרויקט שלי, <strong>“IsraHand”</strong>, פותח מתוך רצון ליצור שינוי
          חברתי אמיתי, במיוחד לנוכח מציאות כלכלית מאתגרת בישראל וצרכים שזיהיתי
          בשטח.
          <br />
          המערכת שפיתחתי מאפשרת לתורמים להציע פריטים מכל תחום (רהיטים, מוצרי
          חשמל, בגדים ועוד) ולקבל חשיפה מיידית לכל מי שזקוק. מבקשי תרומות יכולים
          לגלוש, לבקש, לדרג ולקבל תמיכה – בצורה פשוטה, מאובטחת, נוחה, וללא צורך
          בהשתייכות לעמותות או קבוצות.
          <br />
          במהלך העבודה על הפרויקט רכשתי ידע רב בתחומי Web, ניהול מסדי נתונים,
          אבטחת מידע, ארכיטקטורת תוכנה ועוד. כל שלב פותח על ידי – מתכנון המערכת
          ועד לתיעוד ולבדיקות – מתוך תחושת שליחות ורצון לתרום לחברה דרך
          הטכנולוגיה.
          <br />
          אני מאמין שלטכנולוגיה יש כוח לשנות מציאות – והמערכת הזו היא הצעד
          הראשון שלי בדרך לשם.
        </p>
      </div>
    </div>
  );
};

export default About;
